fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <comment>Планирование работ специалиста у клиента и фиксация фактически выполненных работ.</comment>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <comment>Допускается только договор вида "Абонентское обслуживание".</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <comment>Задолженность клиентов за выполненные работы. Обороты используются при автозаполнении реализации и в отчете по выставленным актам.</comment>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <comment>Оклад и процент от выполненных работ, действующие с указанного месяца.</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <comment>Работы, выполненные специалистом, и причитающаяся ему сумма процента от работ.</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

// Признак того, что после записи документа нужно оповестить специалистов
// через телеграм-бота. Устанавливается в обработчике ПередЗаписью.
Перем ВКМ_ТребуетсяОповещение;

// Признак того, что документ записывается впервые. Запоминается до записи,
// так как в обработчике ПриЗаписи метод ЭтоНовый уже возвращает Ложь.
Перем ВКМ_ЭтоНоваяЗаявка;

#КонецОбласти

#Область ОбработчикиСобытий

// Заполняет документ значениями, переданными при открытии формы.
//
// Без этого обработчика параметр формы "ЗначенияЗаполнения" ни на что не влияет:
// создание обслуживания из календаря специалистов открывало пустую форму.
//
// Параметры:
//  ДанныеЗаполнения     - Структура, Произвольный - значения реквизитов документа.
//  СтандартнаяОбработка - Булево - признак стандартной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВКМ_ЭтоНоваяЗаявка = ЭтоНовый();
	ВКМ_ТребуетсяОповещение = ВКМ_ПланированиеИзменилось();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Или Не ВКМ_ТребуетсяОповещение Тогда
		Возврат;
	КонецЕсли;
	
	ВКМ_Телеграм.ДобавитьУведомление(ВКМ_ТекстОповещения());
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДанныеДоговора = ВКМ_ДанныеДоговора();
	
	Если Не ВКМ_ДоговорКорректен(ДанныеДоговора, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	УсловияОплаты = ВКМ_УсловияОплатыСпециалиста();
	
	Если Не УсловияОплаты.Установлен Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Специалисту не установлен процент оплаты от выполненных работ
			           |на дату документа. Заполните условия оплаты сотрудника.'"),
			ЭтотОбъект, "Специалист", , Отказ);
		Возврат;
	КонецЕсли;
	
	ВКМ_СформироватьДвиженияПоВыполненнымРаботам(ДанныеДоговора.СтоимостьЧасаРаботы);
	ВКМ_СформироватьДвиженияПоРаботамСотрудника(
		ДанныеДоговора.СтоимостьЧасаРаботы, УсловияОплаты.ПроцентОтРабот);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВремяОкончанияПлан <> '00010101' И ВремяНачалаПлан > ВремяОкончанияПлан Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Время окончания работ не может быть раньше времени начала работ.'"),
			ЭтотОбъект,
			"ВремяОкончанияПлан",
			,
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает условия договора, указанного в документе.
//
// Возвращаемое значение:
//  Структура, Неопределено - условия договора,
//                            Неопределено, если договор не найден:
//   * ВидДоговора             - ПеречислениеСсылка.ВидыДоговоровКонтрагентов - вид договора.
//   * ДатаНачала              - Дата   - дата начала действия договора.
//   * ДатаОкончания           - Дата   - дата окончания действия договора.
//   * СтоимостьЧасаРаботы     - Число  - стоимость часа работы специалиста.
//
Функция ВКМ_ДанныеДоговора()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачала КАК ДатаНачала,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончания КАК ДатаОкончания,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор";
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ВидДоговора", Выборка.ВидДоговора);
	Результат.Вставить("ДатаНачала", Выборка.ДатаНачала);
	Результат.Вставить("ДатаОкончания", Выборка.ДатаОкончания);
	Результат.Вставить("СтоимостьЧасаРаботы", Выборка.СтоимостьЧасаРаботы);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что указан договор абонентского обслуживания и дата документа
// попадает в период действия этого договора.
//
// Параметры:
//  ДанныеДоговора - Структура, Неопределено - условия договора, см. ВКМ_ДанныеДоговора.
//  Отказ          - Булево - признак отказа от проведения, устанавливается при ошибке.
//
// Возвращаемое значение:
//  Булево - Истина, если договор пригоден для проведения документа.
//
Функция ВКМ_ДоговорКорректен(ДанныеДоговора, Отказ)
	
	Если ДанныеДоговора = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не удалось получить условия договора.'"), ЭтотОбъект, "Договор", , Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Если ДанныеДоговора.ВидДоговора
		<> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Обслуживание клиента можно провести только по договору
			           |вида «Абонентское обслуживание».'"),
			ЭтотОбъект, "Договор", , Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	ДатаДокумента = НачалоДня(Дата);
	
	Если ДатаДокумента < НачалоДня(ДанныеДоговора.ДатаНачала)
		Или ДатаДокумента > КонецДня(ДанныеДоговора.ДатаОкончания) Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Дата документа не входит в период действия договора (с %1 по %2).'"),
			Формат(ДанныеДоговора.ДатаНачала, "ДЛФ=D"),
			Формат(ДанныеДоговора.ДатаОкончания, "ДЛФ=D"));
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Дата", , Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формирует движения по регистру накопления "ВКМ_ВыполненныеКлиентуРаботы".
// Сумма к оплате рассчитывается по ставке часа, указанной в договоре.
//
// Параметры:
//  СтоимостьЧасаРаботы - Число - ставка часа работы специалиста из договора.
//
Процедура ВКМ_СформироватьДвиженияПоВыполненнымРаботам(СтоимостьЧасаРаботы)
	
	// Перезаписываем и пустой набор: прежние движения при обнулении часов удаляются.
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
	
	ЧасовВсего = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	Если ЧасовВсего = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ЧасовВсего;
	Движение.СуммаКОплате = ЧасовВсего * СтоимостьЧасаРаботы;
	
КонецПроцедуры


// Определяет, изменились ли параметры планирования заявки: дата проведения работ,
// плановое время или назначенный специалист. Для нового документа всегда Истина.
//
// Возвращаемое значение:
//  Булево - Истина, если специалистов нужно оповестить.
//
Функция ВКМ_ПланированиеИзменилось()
	
	Если ЭтоНовый() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Обслуживание.Специалист КАК Специалист,
		|	Обслуживание.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	Обслуживание.ВремяНачалаПлан КАК ВремяНачалаПлан,
		|	Обслуживание.ВремяОкончанияПлан КАК ВремяОкончанияПлан
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК Обслуживание
		|ГДЕ
		|	Обслуживание.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Выборка.Специалист <> Специалист
		Или Выборка.ДатаПроведенияРабот <> ДатаПроведенияРабот
		Или Выборка.ВремяНачалаПлан <> ВремяНачалаПлан
		Или Выборка.ВремяОкончанияПлан <> ВремяОкончанияПлан;
	
КонецФункции

// Формирует текст оповещения о запланированной заявке.
//
// Возвращаемое значение:
//  Строка - текст сообщения для отправки в группу телеграм.
//
Функция ВКМ_ТекстОповещения()
	
	Шаблон = ?(ВКМ_ЭтоНоваяЗаявка,
		НСтр("ru = 'Новая заявка %1 от %2.
		           |Клиент: %3.
		           |Специалист: %4.
		           |Дата работ: %5, с %6 до %7.
		           |Проблема: %8'"),
		НСтр("ru = 'Изменена заявка %1 от %2.
		           |Клиент: %3.
		           |Специалист: %4.
		           |Дата работ: %5, с %6 до %7.
		           |Проблема: %8'"));
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,
		Номер,
		Формат(Дата, "ДЛФ=D"),
		Строка(Клиент),
		Строка(Специалист),
		Формат(ДатаПроведенияРабот, "ДЛФ=D"),
		Формат(ВремяНачалаПлан, "ДФ=ЧЧ:мм"),
		Формат(ВремяОкончанияПлан, "ДФ=ЧЧ:мм"),
		ОписаниеПроблемы);
	
КонецФункции

// Возвращает процент от выполненных работ, установленный специалисту на дату документа.
//
// Возвращаемое значение:
//  Структура - условия оплаты специалиста:
//   * Установлен      - Булево - Истина, если запись условий оплаты найдена.
//   * ПроцентОтРабот  - Число  - процент от выполненных работ, возможен нулевой.
//
Функция ВКМ_УсловияОплатыСпециалиста()
	
	Отбор = Новый Структура("Сотрудник", Специалист);
	Условия = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.ПолучитьПоследнее(Дата, Отбор);
	
	Результат = Новый Структура;
	Результат.Вставить("Установлен", Ложь);
	Результат.Вставить("ПроцентОтРабот", 0);
	
	// Нулевой процент - допустимая настройка, поэтому проверяется наличие самой записи,
	// а не заполненность значения.
	ЗаписиУсловий = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(Дата, Отбор);
	Если ЗаписиУсловий.Количество() > 0 Тогда
		Результат.Установлен = Истина;
		Результат.ПроцентОтРабот = Условия.ПроцентОтРабот;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует движения по регистру "ВКМ_ВыполненныеСотрудникомРаботы".
// Сумма специалиста рассчитывается как часы к оплате клиенту, умноженные
// на ставку часа из договора и процент от работ.
//
// Параметры:
//  СтоимостьЧасаРаботы - Число - ставка часа работы специалиста из договора.
//  ПроцентОтРабот      - Число - процент специалиста от выполненных работ.
//
Процедура ВКМ_СформироватьДвиженияПоРаботамСотрудника(СтоимостьЧасаРаботы, ПроцентОтРабот)
	
	// Перезаписываем и пустой набор при повторном проведении документа.
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	
	ЧасовВсего = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	Если ЧасовВсего = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Специалист;
	Движение.ЧасовКОплате = ЧасовВсего;
	Движение.СуммаКОплате = ЧасовВсего * СтоимостьЧасаРаботы * ПроцентОтРабот / 100;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
